public/how-to.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Making of</title>
<meta name="generator" content="Org mode" />
<link rel="shortcut icon" type="image/png" href="img/favicon.png" /><link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" /><header>      <h1><code>balaye.net</code></h1>      <p>A personal eclectic domain.</p>      <nav>  <a href="./index.html">Home</a>  <a href="https://github.com/pietrodito">Github</a>  <a href="https://stackoverflow.com/users/6537892/pietrodito">Stack Overflow</a>  <a href="./snds.html">SNDS</a>  <a href="./guitar-repertoire.html">Guitar</a>  <a href="./how-to.html">Making of</a>  <a href="./contact.html">Contact</a>      </nav></header>
</head>
<body>
<div id="content">

<div id="outline-container-orgde98281" class="outline-2">
<h2 id="orgde98281">What I have done so far to make this site up</h2>
<div class="outline-text-2" id="text-orgde98281">
<hr />
</div>

<div id="outline-container-org80d8586" class="outline-3">
<h3 id="org80d8586">Build the html static pages with emacs</h3>
<div class="outline-text-3" id="text-org80d8586">
</div>
<div id="outline-container-orgf26a5cb" class="outline-4">
<h4 id="orgf26a5cb">Read this tutorial:</h4>
<div class="outline-text-4" id="text-orgf26a5cb">
<ul class="org-ul">
<li><a href="https://systemcrafters.net/publishing-websites-with-org-mode/building-the-site/">https://systemcrafters.net/publishing-websites-with-org-mode/building-the-site/</a></li>
</ul>
</div>

<ul class="org-ul">
<li><a id="org0630860"></a>More details:<br />
<div class="outline-text-5" id="text-org0630860">
<ul class="org-ul">
<li><a href="https://orgmode.org/manual/Publishing.html">https://orgmode.org/manual/Publishing.html</a></li>
<li><a href="https://orgmode.org/manual/HTML-Export.html">https://orgmode.org/manual/HTML-Export.html</a></li>
<li><a href="https://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html">https://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html</a></li>
</ul>


<hr />
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org39c8b57" class="outline-3">
<h3 id="org39c8b57">Google Cloud Hosting</h3>
<div class="outline-text-3" id="text-org39c8b57">
<ul class="org-ul">
<li><a href="https://cloud.google.com/storage/docs/hosting-static-website?hl=fr#objectives">https://cloud.google.com/storage/docs/hosting-static-website?hl=fr#objectives</a></li>
</ul>
</div>

<div id="outline-container-orgc72eadd" class="outline-4">
<h4 id="orgc72eadd">Sync local files to google bucket with CLI</h4>
<div class="outline-text-4" id="text-orgc72eadd">
</div>
<ul class="org-ul">
<li><a id="org520e8ba"></a>Install gsutil<br />
<div class="outline-text-5" id="text-org520e8ba">
<div class="org-src-container">
<pre class="src src-bash">sudo apt-get install apt-transport-https ca-certificates gnupg
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"deb [signed-by=/usr/share/keyrings/cloud.google.gpg] https://packages.cloud.google.com/apt cloud-sdk main"</span> | sudo tee -a /etc/apt/sources.list.d/google-cloud-sdk.list
curl https://packages.cloud.google.com/apt/doc/apt-key.gpg | sudo apt-key --keyring /usr/share/keyrings/cloud.google.gpg add -
sudo apt-get update &amp;&amp; sudo apt-get install google-cloud-cli
</pre>
</div>

<hr />
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgb2652b4" class="outline-3">
<h3 id="orgb2652b4">Use cloudflare for free SSL certificate</h3>
<div class="outline-text-3" id="text-orgb2652b4">
<ul class="org-ul">
<li><p>
<a href="https://dash.cloudflare.com/228fddaae61d793f4f42d6fa7113c567/balaye.net">https://dash.cloudflare.com/228fddaae61d793f4f42d6fa7113c567/balaye.net</a>
</p>

<p>
You have to redirect connections from Google Domains (DNS submenu) to CloudFlare
</p></li>
</ul>

<hr />
</div>
</div>
<div id="outline-container-orgb41756b" class="outline-3">
<h3 id="orgb41756b">Use simple css</h3>
<div class="outline-text-3" id="text-orgb41756b">
<ul class="org-ul">
<li><a href="https://simplecss.org/">https://simplecss.org/</a></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
